exercises/2-3/cylinder2D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2406                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

7
(
    top
    {
        type            patch;
        nFaces          135;
        startFace       19360;
    }
    bottom
    {
        type            patch;
        nFaces          135;
        startFace       19495;
    }
    inlet
    {
        type            patch;
        nFaces          55;
        startFace       19630;
    }
    outlet
    {
        type            patch;
        nFaces          55;
        startFace       19685;
    }
    back
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9800;
        startFace       19740;
    }
    front
    {
        type            empty;
        inGroups        1(empty);
        nFaces          9800;
        startFace       29540;
    }
    cylinder
    {
        type            patch;
        nFaces          100;
        startFace       39340;
    }
)

// ************************************************************************* //
